<template>
	<div id="music-ctrl" >
		<div id="toggle-play" @click="togglePlay($event)" :class="{active: isPlay}">
			
		</div>
		<em class="pre"  @click="next($event)"></em>
		<em class="next" @click="next($event)"></em>
	</div>
</template>

<script>
import {Bus} from '../bus.js'

export default {
	data() {
		return {
			songList:[
				{
					songName: '安河桥',
					singer: '宇西',
					path: 'src/assets/hotsongs11.jpg',
					song: 'src/music/anheqiao.mp3',
					songTime:  ["[00:00.79]", "[00:02.84]", "[00:04.50]", "[00:06.43]", "[00:37.85]", "[00:40.13]", "[00:42.31]", "[00:44.34]", "[00:49.85]", "[00:52.64]", "[00:54.94]", "[00:56.80]", "[00:59.11]", "[01:01.37]", "[01:02.17]", "[01:04.23]", "[01:06.50]", "[01:10.13]", "[01:13.83]", "[01:19.67]", "[01:21.22]", "[01:24.16]", "[01:28.60]", "[01:31.85]", "[01:33.69]", "[01:36.91]", "[01:39.20]", "[01:41.10]", "[01:43.63]", "[01:46.57]", "[01:48.85]", "[01:51.69]", "[01:54.01]", "[01:56.17]", "[01:58.12]", "[01:59.55]", "[02:00.91]", "[02:03.32]", "[02:35.07]", "[02:38.79]", "[02:42.47]", "[02:48.34]", "[02:49.83]", "[02:52.78]", "[02:57.21]", "[02:59.94]", "[03:00.49]", "[03:02.21]", "[03:04.61]", "[03:08.33]", "[03:11.98]", "[03:17.95]", "[03:19.38]", "[03:23.05]", "[03:26.75]", "[03:29.03]", "[03:30.45]"],
					songContent: ["安和桥 - 宇西", "词：宋冬野", "曲：宋冬野", "", "让我再看你一遍", "从南到北", "", "像是被五环路蒙住的双眼", "", "请你再讲一遍", "关于那天", "", "抱着盒子的姑娘", "", "和擦汗的男人", "", "我知道 那些夏天", "就像青春一样回不来", "代替梦想的也只能是勉为其难", "", "我知道 吹过的牛逼", "也会随青春一笑了之", "让我困在城市里", "纪念你", "", "让我再尝一口", "秋天的酒", "", "一直往南方开", "不会太久", "", "让我再听一遍", "最美的那一句", "", "你回家了", "", "我在等你呢", "", "我知道 那些夏天", "就像青春一样回不来", "代替梦想的也只能是勉为其难", "", "我知道 吹过的牛逼", "也会随青春一笑了之", "让我困在城市里", "", "纪念你", "", "我知道 那些夏天", "就像你一样回不来", "我也不会再对谁满怀期待", "", "我知道 这个世界", "每天都有太多遗憾", "所以你好", "", "再见"]
				},
				{
					songName: '修炼爱情',
					singer: '宇西',
					path: 'src/assets/hot10.jpg',
					song: 'src/music/xiulianaiqing.mp3',
					songTime: ["[00:00.27]", "[00:01.59]", "[00:02.48]", "[00:03.52]", "[00:17.33]", "[00:20.90]", "[00:24.29]", "[00:27.54]", "[00:29.18]", "[00:34.07]", "[00:36.30]", "[00:41.44]", "[00:43.56]", "[00:45.17]", "[00:46.48]", "[00:49.35]", "[00:50.05]", "[00:53.55]", "[00:54.10]", "[00:56.29]", "[00:59.73]", "[01:00.74]", "[01:02.50]", "[01:04.27]", "[01:07.70]", "[01:08.20]", "[01:10.04]", "[01:14.00]", "[01:14.88]", "[01:17.67]", "[01:18.42]", "[01:21.86]", "[01:22.49]", "[01:24.67]", "[01:27.99]", "[01:29.15]", "[01:31.00]", "[01:32.74]", "[01:36.68]", "[01:38.47]", "[01:42.62]", "[01:46.37]", "[01:49.71]", "[01:53.38]", "[01:56.69]", "[01:58.08]", "[02:03.31]", "[02:05.16]", "[02:10.90]", "[02:11.88]", "[02:14.51]", "[02:15.39]", "[02:18.07]", "[02:18.91]", "[02:22.39]", "[02:22.94]", "[02:25.17]", "[02:28.34]", "[02:29.62]", "[02:31.43]", "[02:33.16]", "[02:36.59]", "[02:37.13]", "[02:38.89]", "[02:42.94]", "[02:43.81]", "[02:46.47]", "[02:47.35]", "[02:50.78]", "[02:51.36]", "[02:53.61]", "[02:56.62]", "[02:58.05]", "[02:59.95]", "[03:01.65]", "[03:05.00]", "[03:05.60]", "[03:07.44]", "[03:11.59]", "[03:24.07]", "[03:26.60]", "[03:27.45]", "[03:30.22]", "[03:30.96]", "[03:35.51]", "[03:38.97]", "[03:41.64]", "[03:42.49]", "[03:45.98]", "[03:46.57]", "[03:48.77]", "[03:52.38]", "[03:53.23]", "[03:55.02]", "[03:56.75]", "[04:00.15]", "[04:00.74]", "[04:02.60]", "[04:06.08]", "[04:07.47]","[04:09.21]","[04:10.95]","[04:14.35]","[04:14.97]","[04:16.71]"],
					songContent: ["修炼爱情 - 宇西", "词：易家扬", "曲：林俊杰", "", "凭什么要失望", "", "藏眼泪到心脏", "", "往事不会说谎别跟它为难", "", "我们两人之间不需要这样", "", "我想", "", "修炼爱情的心酸", "", "学会放好以前的渴望", "", "我们那些信仰", "要忘记多难", "", "远距离的欣赏", "近距离的迷惘", "谁说太阳会找到月亮", "", "别人有的爱", "我们不可能模仿", "", "修炼爱情的悲欢", "", "我们这些努力不简单", "", "快乐炼成泪水", "是一种勇敢", "", "几年前的幻想", "几年后的原谅", "为一张脸去养一身伤", "别讲想念我", "我会受不了这样", "", "记忆它真嚣张", "", "路灯把痛点亮", "", "情人一起看过多少次月亮", "", "它在天空看过多少次遗忘", "", "多少心慌", "", "修炼爱情的心酸", "", "学会放好以前的渴望", "", "我们那些信仰", "要忘记多难", "", "远距离的欣赏", "近距离的迷惘", "谁说太阳会找到月亮", "", "别人有的爱", "我们不可能模仿", "", "修炼爱情的悲欢", "", "我们这些努力不简单", "", "快乐炼成泪水", "是一种勇敢", "", "几年前的幻想", "几年后的原谅", "为一张脸去养一身伤", "", "别讲想念我", "我会受不了这样", "", "笑着说爱让人疯狂", "", "哭着说爱让人紧张", "", "忘不了那个人就投降", "", "修炼爱情的悲欢", "", "我们这些努力不简单", "", "快乐炼成泪水", "是一种勇敢", "", "几年前的幻想", "几年后的原谅", "为一张脸去养一身伤", "", "别讲想念我", "我会受不了这样", "", "几年前的幻想","几年后的原谅","为一张脸去养一身伤","别讲想念我","我会受不了这样"]
				},
				{
					songName: '年轮',
					singer: '宇西',
					path: 'src/assets/content4.jpg',
					song: 'src/music/nianlun.mp3',
					songTime: ["[00:00.86]", "[00:02.14]", "[00:03.30]", "[00:04.55]", "[00:18.89]", "[00:21.90]", "[00:25.11]", "[00:28.30]", "[00:31.04]", "[00:31.56]", "[00:34.76]", "[00:38.10]", "[00:41.26]", "[00:43.92]", "[00:44.63]", "[00:47.80]", "[00:51.04]", "[00:54.24]", "[00:56.89]", "[00:57.49]", "[01:00.70]", "[01:04.03]", "[01:07.25]", "[01:09.70]", "[01:13.10]", "[01:14.67]", "[01:17.67]", "[01:22.90]", "[01:26.02]", "[01:27.64]", "[01:30.59]", "[01:37.15]", "[01:46.58]", "[01:49.23]", "[01:52.55]", "[01:55.67]", "[01:58.16]", "[01:59.15]", "[02:02.25]", "[02:05.58]", "[02:08.75]", "[02:11.23]", "[02:12.11]", "[02:15.19]", "[02:18.48]", "[02:21.65]", "[02:24.33]", "[02:25.05]", "[02:28.19]", "[02:31.51]", "[02:34.71]", "[02:36.74]", "[02:37.28]", "[02:40.52]", "[02:42.11]", "[02:45.24]", "[02:50.45]", "[02:53.52]", "[02:55.07]", "[02:58.03]", "[03:03.82]", "[03:26.88]", "[03:29.15]", "[03:30.80]", "[03:33.89]", "[03:38.73]", "[03:42.07]", "[03:43.66]", "[03:46.72]", "[03:52.57]", "[03:53.63]"],
					songContent: ["年轮 - 宇西", "词：汪苏泷", "曲：汪苏泷", "", "圆圈勾勒成指纹", "印在我的嘴唇", "回忆苦涩的吻痕", "是树根", "", "春去秋来的茂盛", "却遮住了黄昏", "寒夜剩我一个人", "等清晨", "", "世间最毒的仇恨", "是有缘却无分", "可惜你从未心疼", "我的笨", "", "荒草丛生的青春", "倒也过的安稳", "代替你陪着我的", "是年轮", "数着一圈圈年轮", "我认真", "将心事都封存", "密密麻麻是我的自尊", "修改一次次离分", "我承认", "曾幻想过永恒", "可惜从没人陪我演这剧本", "", "圆圈勾勒成指纹", "印在我的嘴唇", "回忆苦涩的吻痕", "是树根", "", "春去秋来的茂盛", "却遮住了黄昏", "寒夜剩我一个人", "等清晨", "", "世间最毒的仇恨", "是有缘却无分", "可惜你从未心疼", "我的笨", "", "荒草丛生的青春", "倒也过的安稳", "代替你陪着我的", "是年轮", "", "数着一圈圈年轮", "我认真", "将心事都封存", "密密麻麻是我的自尊", "修改一次次离分", "我承认", "曾幻想过永恒", "可惜从没人陪我演这剧本", "", "一圈圈年轮", "我认真", "将心事都封存", "密密麻麻是我的自尊", "修改一次次离分", "我承认", "曾幻想过永恒", "可惜从没人陪我演这剧本", "", "可惜从没人陪我演这剧本"]
				},{
					songName: '告白气球',
					singer: '宇西',
					path: 'src/assets/content7.jpg',
					song: 'src/music/gaobaiqiqiu.mp3',
					songTime: ["[00:01.03]", "[00:02.81]", "[00:03.95]", "[00:05.25]", "[00:23.24]", "[00:25.75]", "[00:28.58]", "[00:32.00]", "[00:33.78]", "[00:36.47]", "[00:39.54]", "[00:42.17]", "[00:43.62]", "[00:46.11]", "[00:48.85]", "[00:51.43]", "[00:54.13]", "[00:56.80]", "[00:59.49]", "[01:03.95]", "[01:04.68]", "[01:10.70]", "[01:14.55]", "[01:15.23]", "[01:21.31]", "[01:25.50]", "[01:48.66]", "[01:51.11]", "[01:53.90]", "[01:57.36]", "[01:59.13]", "[02:01.72]", "[02:04.51]", "[02:07.45]", "[02:08.96]", "[02:11.35]", "[02:14.11]", "[02:16.74]", "[02:19.45]", "[02:22.12]", "[02:24.77]", "[02:29.25]", "[02:29.95]", "[02:35.94]", "[02:39.87]", "[02:40.60]", "[02:46.81]", "[02:50.56]", "[02:51.32]", "[02:57.54]", "[03:01.38]", "[03:02.51]", "[03:08.01]", "[03:11.95]", "[03:12.71]", "[03:18.83]"],
					songContent: ["告白气球 - 宇西", "词：方文山", "曲：周杰伦", "", "塞纳河畔左岸的咖啡", "我手一杯品尝你的美", "留下唇印的嘴", "", "花店玫瑰名字写错谁", "告白气球风吹到对街", "微笑在天上飞", "", "你说你有点难追", "想让我知难而退", "礼物不需挑最贵", "只要香榭的落叶", "营造浪漫的约会", "不害怕搞砸一切", "拥有你就拥有全世界", "", "亲爱的爱上你从那天起", "甜蜜的很轻易", "", "亲爱的别任性你的眼睛", "在说我愿意", "", "塞纳河畔左岸的咖啡", "我手一杯品尝你的美", "留下唇印的嘴", "", "花店玫瑰名字写错谁", "告白气球风吹到对街", "微笑在天上飞", "", "你说你有点难追", "想让我知难而退", "礼物不需挑最贵", "只要香榭的落叶", "营造浪漫的约会", "不害怕搞砸一切", "拥有你就拥有全世界", "", "亲爱的爱上你从那天起", "甜蜜的很轻易", "", "亲爱的别任性你的眼睛", "在说我愿意", "", "亲爱的爱上你恋爱日记", "飘香水的回忆", "", "一整瓶的梦境全都有你", "搅拌在一起", "", "亲爱的别任性你的眼睛", "在说我愿意"]
				}
			],
			isPlay: false,
			initNext: 0,
			mode: 'order',
			indexBox: []
		}
	},
	mounted(){
		Bus.$on('playMode',(data)=>{
			this.mode = data;
			
		})
	},
	computed: {
		// fContent() {
		// 	let data = this.songList;
		// 	data.forEach((val,i)=>{
		// 		val.filter((val,index,item)=> {
		// 			if(val === ''){
		// 				item.splice(index,1);
		// 				this.indexBox.push(index);
		// 			}
		// 		} )
		// 	})
			
		// 	return data.songContent;
		// },
		// fTime() {

		// }
	}
	,
	props:['songChange'],
	methods: {
		togglePlay(e){
			this.isPlay = !this.isPlay;
			this.$emit('toPlay',this.isPlay);
		},
		next(e){
			this.isPlay = false;
			var className = e.target.className;
			console.log('开启' + this.mode)
			switch (this.mode){
				case 'order':
					if(className == 'next'){
						if(this.initNext === 3)
							return false;
						this.initNext++;
					}else{
						if(this.initNext === 0)
							return false;
						this.initNext--;
					}
					break;
				case 'random':
					var len = this.songList.length,
					    random = parseInt(Math.random()*len);
						while(random == this.initNext){
							random = parseInt(Math.random()*len)
						}
						this.initNext = random;
					break;
				case 'loop':
					if(className == 'next'){
						if(this.initNext === 3)
							this.initNext = -1;
						this.initNext++;
					}else{
						if(this.initNext === 0)
							this.initNext = 4;
						this.initNext--;
					}
					break;
				case 'single-play':
					//
					break;
			}
			
			
			this.$emit('transData',[this.songList[this.initNext], this.isPlay]);
		}
	}
}

</script>
<style lang="sass" scoped>
@import '../common/common.scss';
	%style{
		
		position: absolute;
		width: rem(100);
		height: 100%;
		top:0px;
		background-image: url(../assets/player.png);
		background-size: rem(250); 
		box-sizing: border-box;
		background-repeat: no-repeat;
		background-origin: content-box;
		background-clip: content-box;
		padding: rem(20);
	}
	#music-ctrl {
		position: absolute;
		right: rem(80);
		top:rem(100);
		width: rem(280);
		height: rem(80);
		text-align: center;
		#toggle-play{
			position: relative;
		    display: inline-block;
		    width: rem(80);
		    height: rem(80);
		    background-image:  url(../assets/sprite_play.png);
		    background-position: rem(25) rem(-285);
		    background-repeat: no-repeat;
		    background-origin: content-box;
		    background-clip: content-box;
		    background-size: rem(80);
		    padding: rem(5);
		    border-radius: 50%;
		    border: 1px solid #fff;
		    &.active{
		    	 background-position: rem(25) rem(-340);
		    }
		    
		}
		.pre{
			@extend %style;
			right:rem(210);
			background-position: 0 rem(-60);
		};
		.next{
			@extend %style;
			left: rem(230);
			background-position: 0 rem(-100);
		};
	}
</style>